# 1. Берем за основу легкий образ Python 3.9
FROM python:3.9-slim

# 2. Указываем рабочую папку внутри контейнера
WORKDIR /app

# 3. Сначала копируем только requirements.txt (для кэширования)
COPY requirements.txt .

# 4. Устанавливаем библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем исходный код (папку src) внутрь контейнера в папку /app/src
COPY src/ src/

# 6. Копируем папку с моделями внутрь контейнера в папку /app/models
COPY models/ models/
# (Если у тебя еще нет файла models/model40.joblib, убедись, что он там есть, 
# либо временно скопируй его туда руками, либо запусти скрипт обучения)

# 7. Открываем порт 5000 (стандартный для Flask)
EXPOSE 5000

# 8. Команда, которая сработает при запуске контейнера
# Мы указываем путь src/app.py, так как находимся в папки /app
CMD ["python", "src/app.py"]